## Pandas Day -11

###  groupby() function  
- Pandas GroupBy function is used to split the data into groups based on some criteria.

In [2]:
import pandas as pd

In [45]:
df=pd.read_csv("student_result1.csv")
df

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

### Grouping Data by Single Column

In [46]:
# method 1
group_section=df.groupby(by='Section')
group_section.groups

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [11]:
# method 2
df.groupby(by='Section').groups

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

### Grouping by Multiple Columns

In [30]:
df.groupby(['Section','Class']).groups

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3], ('C', 12): [4]}

In [31]:
for Class, df in group_section:
 print(Class)
 print(df)

A
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
B
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [32]:
for Section , df in group_section:
 print(Class)
 print(df)

C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

### A single group can be selected using get_group():

In [34]:
df=pd.read_csv("student_result1.csv")

In [35]:
g2 = df.groupby('Class').get_group(10)
g2

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [36]:
g3 = df.groupby('Section').get_group('A')
g3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

### Applying Aggregation (mean)

In [47]:
group_section.mean()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A            1002.0   10.0        2.5                     2.5        55.0
B            1002.0   10.0        6.0                     2.0        80.0
C            1004.5   11.5        2.5                     1.5        60.0

### Grouping with sum

In [48]:
group_section.sum()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A              2004     20          5                       5         110
B              1002     10          6                       2          80
C              2009     23          5                       3         120

### Multiple Aggregations

In [49]:
g1.agg(['mean','max','sum'])

        Student ID             Class         Study hrs          \
              mean   max   sum  mean max sum      mean max sum
Section
A           1002.0  1003  2004  10.0  10  20       2.5   3   5
B           1002.0  1002  1002  10.0  10  10       6.0   6   6
C           1004.5  1005  2009  11.5  12  23       2.5   5   5

        Social Media usage hrs         Percentage
                          mean max sum       mean max  sum
Section
A                          2.5   3   5       55.0  60  110
B                          2.0   2   2       80.0  80   80
C                          1.5   2   3       60.0  75  120

### Conclusion
The groupby() function is used to group data and apply aggregation operations.